WSDL_Header/ReadMe/request1.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soap:Header>
		<quote_timestamp xmlns="http://soapheader.ibm.com">2012-12-08T00:00:00
		</quote_timestamp>
	</soap:Header>
	<soap:Body>
		<getLastSellPrice xmlns="http://soapheader.ibm.com">
			<ticker>aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa</ticker>
		</getLastSellPrice>
		<quote_timestamp xmlns="http://soapheader.ibm.com">2012-12-08T00:00:00
		</quote_timestamp>
	</soap:Body>
</soap:Envelope>